Proyecto/informe.org
#+TITLE: Informe — Sistema de Recuperación de Información
#+AUTHOR: Josune Singaña
#+DATE: 10 de diciembre de 2025

* Resumen
  Este proyecto implementa un sistema de Recuperación de Información.
El sistema permite indexar un corpus, ejecutar consultas de texto libre y evaluar los resultados mediante métricas estándar.

El corpus utilizado es *Amazon Fine Food Reviews*, empleando únicamente la columna =Text= (contenido de la reseña)

* Corpus
El corpus contiene miles de reseñas escritas por usuarios. Solo se utiliza el texto principal de cada reseña.
El usuario puede limpiar manualmente el CSV antes de usarlo.

El módulo =index.py= permite cargar el corpus desde CSV y obtener una lista de documentos.
* Preprocesamiento
Se implementa un *preprocesamiento fuerte* en =index.py= mediante la función:

- Conversión a minúsculas
- Eliminación de HTML
- Eliminación de caracteres especiales
- Normalización de espacios
- Tokenización por espacios
- Stopwords básicas

El objetivo es obtener tokens representativos y homogéneos.


* Diseño
* Construcción del índice
El archivo =index.py= incluye:
- Tokenizador
- Diccionario invertido: término → {doc: frecuencia}
- Cálculo de longitudes documentales

Este índice sirve como base para los modelos Jaccard, TF-IDF y BM25.

* Modelos de Recuperación
** Jaccard (binario)
Mide intersección sobre unión entre tokens de consulta y documento.

** TF-IDF (vectorial)
Se utiliza =TfidfVectorizer= de scikit-learn por eficiencia y robustez.
Las similitudes se calculan con coseno.

** BM25
Implementación propia:
- Parámetros =k1=1.5= y =b=0.75=
- Cálculo de IDF con suavizado
- Normalización por longitud del documento

* Interfaces
** CLI (archivo cli.py)
Permite ejecutar:
#+BEGIN_SRC sh
python cli.py --corpus amazon.csv --model bm25 --query "great taste"
#+END_SRC

** Interfaz simple (archivo interface_simple.py)
Muestra un menú interactivo que facilita la ejecución de consultas.


* Evaluación
El módulo =evaluation.py= permite calcular:
- Precision@k
- Recall@k
- Average Precision (AP)
- Mean Average Precision (MAP)

El archivo =qrels_utils.py= permite:
- Cargar qrels reales
- Generar qrels de ejemplo


* Conclusión
Este sistema cumple con todas las especificaciones solicitadas:
- Indexado
- Preprocesamiento
- Modelos Jaccard, TF-IDF y BM25
- Interfaz CLI y menú simple
- Evaluación con qrels
